frontend/modules/profile/controllers/SiteController.php

    public function actionIndex()
    {
    	$modes = User::findOne(Yii::$app->user->identity->id);
---
SELECT * FROM `user` WHERE `id`=1