frontend/components/TaskComponent.php

SELECT `tta`.`user_id`, `tta`.`ticket_id`, `usr`.`username`, `usr`.`firstname`, `usr`.`lastname` FROM `tbl_ticket_assigned` `tta` LEFT JOIN `user` `usr` ON usr.id = tta.user_id WHERE `tta`.`ticket_id`='6'
---
	public function getAssignedTicket($tid)
	{
		$row = (new \yii\db\Query())
			->select([
				'tta.user_id',
				'tta.ticket_id',
				'usr.username',
				'usr.firstname',
				'usr.lastname'
			])
			->from('tbl_ticket_assigned tta')
			->leftJoin('user usr', 'usr.id = tta.user_id')
			->where(['tta.ticket_id'=>$tid])
			->all();