frontend/modules/admin/models/UserUpdateForm.php

SELECT * FROM `user` WHERE `id`='8'
---
    public function update($did)
    {

        if ($this->validate()) {
            $update = User::findOne($did);