frontend/modules/admin/models/UserForm.php

    public function validateUsername()
    {
        $user = User::findByUsername(Yii::$app->user->identity->id);
---
SELECT EXISTS(SELECT * FROM `user` WHERE `username`='arbi')

    public function create()
    {
        if ($this->validate()) {
            $create = new User();
            $create->username = trim(strip_tags($this->username));
            $create->firstname = trim(strip_tags($this->firstname));
            $create->lastname = trim(strip_tags($this->lastname));
            $create->email = $this->email;
            $create->level_user = $this->level_user;
            $create->setPassword($this->password);
            $create->generateAuthKey();
            if($create->save(false))
---
INSERT INTO `user` (`username`, `firstname`, `lastname`, `email`, `level_user`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('arbi', 'Kanza', 'Arbi', 'arbi@gmail.com', 7, '$2y$13$4IYB2pKTW6kD4Dk.umv1Ee3P/qclBpo495gr4b9d2dThYQHZYKiPu', 'gYGW-QGteFgKfn997kelIXJC3fD7MyKg', 1467260228, 1467260228)