frontend/modules/admin/controllers/SiteController.php

SELECT COUNT(*) FROM `user`
---
    public function actionIndex()
    {
        $search = '';
        if(isset($_GET['search']))
        {
            $search =  strtolower(trim(strip_tags($_GET['search'])));
        }

        $query = (new \yii\db\Query())
                    ->select([
                        'id',
                        'username',
                        'email',
                        'firstname',
                        'lastname',
                        'level_user',
                        'status',
                    ])
                    ->from('user');

        if($search !== '')
        {
            $query->where('lower(username) LIKE "%'.$search.'%" ')
                    ->orWhere('lower(firstname) LIKE "%'.$search.'%"')
                    ->orWhere('lower(lastname) LIKE "%'.$search.'%"');
        }

        $countQuery = clone $query;
        $pageSize = 10;
        $pages = new Pagination([
                'totalCount' => $countQuery->count(),
                'pageSize'=>$pageSize
            ]);