frontend/modules/ticket/models/TicketForm.php

INSERT INTO `tbl_ticket` (`ticket_name`, `ticket_desc`, `ticket_date_create`, `ticket_date_update`, `ticket_status`, `user_id`) VALUES ('Komputer Baru Mati', 'Lorem Ipsum Dolor Sit Amet', '2016-06-30', '2016-06-30', 0, 8)
---
    public function create()
    {
        if ($this->validate()) {
            $create = new TableTicket();
            $create->ticket_name = trim(strip_tags($this->ticket_name));
            $create->ticket_desc = trim(strip_tags($this->ticket_desc));
            $create->ticket_date_create = date('Y-m-d');
            $create->ticket_date_update = date('Y-m-d');
            $create->ticket_status = Constants::waiting_queues;
            $create->user_id = Yii::$app->user->identity->id;
            if($create->save(false))

UPDATE `tbl_ticket` SET `ticket_status`=2 WHERE `ticket_id`=11
---
    public function setTicketStatus($tid, $tstatus)
    {
        $model = $this->findModel($tid);
        $model->ticket_status = $tstatus;
        $model->save(false);

SELECT * FROM `tbl_ticket` WHERE `ticket_id`='11'
---
    protected function findModel($id)
    {
        if (($model = TableTicket::findOne($id)) !== null) {