frontend/modules/ticket/models/TicketModel.php

SELECT * FROM `tbl_ticket_assigned` WHERE (`ticket_id`='1') AND (`user_id`='5')
INSERT INTO `tbl_ticket_assigned` (`ticket_id`, `user_id`, `assigned_date`, `assigned_user_id`) VALUES (1, 5, '2016-06-29 09:56:04', 4)
---
	public function insertAssigned($tid,$uid)
	{
		$find = TableTicketAssigned::find()->where(['ticket_id'=>$tid, 'user_id'=>$uid] )->one();
		if(!$find)
		{
			$model = new TableTicketAssigned();
			$model->ticket_id = $tid;
			$model->user_id = $uid;
			$model->assigned_date = date('Y-m-d H:i:s');
			$model->assigned_user_id = Yii::$app->user->identity->id;
			$model->save(false);

SELECT `user_id` FROM `tbl_ticket_assigned` WHERE `ticket_id`='1'
---
	private function getMemberActive($tid)
	{
		$array = TableTicketAssigned::find()->select(['user_id'])->where(['ticket_id'=>$tid])->all();

SELECT `tta`.`user_id`, `tta`.`ticket_id`, `usr`.`username`, `usr`.`firstname`, `usr`.`lastname` FROM `tbl_ticket_assigned` `tta` LEFT JOIN `user` `usr` ON usr.id = tta.user_id WHERE `tta`.`ticket_id`='8'
---
	public function getAssignedTicket($tid)
	{
		$row = (new \yii\db\Query())
			->select([
				'tta.user_id',
				'tta.ticket_id',
				'usr.username',
				'usr.firstname',
				'usr.lastname'
			])
			->from('tbl_ticket_assigned tta')
			->leftJoin('user usr', 'usr.id = tta.user_id')
			->where(['tta.ticket_id'=>$tid])
			->all();

SELECT `tt`.`ticket_id`, `tt`.`ticket_name`, `tt`.`ticket_desc`, `tt`.`ticket_date_create`, `tt`.`ticket_date_update`, `tt`.`ticket_status`, `tt`.`user_id`, `us`.`firstname`, `us`.`lastname`, `us`.`level_user` FROM `tbl_ticket` `tt` LEFT JOIN `user` `us` ON us.id = tt.user_id WHERE 1  AND (year(ticket_date_create)=2016 AND month(ticket_date_create)=6 )
---
	public function printMpdf($progress = 1000, $month = 0, $year= 0)
	{

		$ticket_status = '';
        if($progress != 1000 && $progress != '' )
        {
            $ticket_status = ' AND ticket_status ='.$progress.' ';
        }

        $year_query = '';
        if($month !== '' && $year !== '' && $month !== 0 && $year !== 0)
        {
            $year_query = ' AND (year(ticket_date_create)='.$year.' AND month(ticket_date_create)='.$month.' ) ';
        }

		$row = (new \yii\db\Query())
			->select([
				'tt.ticket_id',
                'tt.ticket_name',
                'tt.ticket_desc',
                'tt.ticket_date_create',
                'tt.ticket_date_update',
                'tt.ticket_status',
                'tt.user_id',
                'us.firstname',
                'us.lastname',
                'us.level_user',
			])
			->from('tbl_ticket tt')
            ->leftJoin('user us', 'us.id = tt.user_id')
            ->where('1 '.$ticket_status.$year_query)
			->all();